zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_mathacl.h
/* ===== 操作数/结果寄存器位域 ===== */
/* MATHACL_OP2 Bits - 操作数2 */
/* MATHACL_OP2[DATA] Bits */
#define MATHACL_OP2_DATA_OFS                     (0)                             /* !< DATA Offset */
#define MATHACL_OP2_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Operand 2 Register */

/* MATHACL_OP1 Bits - 操作数1（写入此寄存器触发运算开始） */
/* MATHACL_OP1[DATA] Bits */
#define MATHACL_OP1_DATA_OFS                     (0)                             /* !< DATA Offset */
#define MATHACL_OP1_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Operand 1 register. */

/* MATHACL_RES1 Bits - 结果1（低32位，或除法的商） */
/* MATHACL_RES1[DATA] Bits */
#define MATHACL_RES1_DATA_OFS                    (0)                             /* !< DATA Offset */
#define MATHACL_RES1_DATA_MASK                   ((uint32_t)0xFFFFFFFFU)         /* !< Result 1 register */

/* MATHACL_RES2 Bits - 结果2（高32位，或除法的余数） */
/* MATHACL_RES2[DATA] Bits */
#define MATHACL_RES2_DATA_OFS                    (0)                             /* !< DATA Offset */
#define MATHACL_RES2_DATA_MASK                   ((uint32_t)0xFFFFFFFFU)         /* !< Result 2 register */

/* ===== 状态寄存器 (STATUS) 位域 ===== */
/* MATHACL_STATUS Bits */
/* MATHACL_STATUS[UF] 下溢标志位 */
/* MATHACL_STATUS[UF] Bits */
#define MATHACL_STATUS_UF_OFS                    (0)                             /* !< UF Offset */
#define MATHACL_STATUS_UF_MASK                   ((uint32_t)0x00000001U)         /* !< Underflow Flag */
#define MATHACL_STATUS_UF_NO_UNDERFLOW           ((uint32_t)0x00000000U)         /* !< No undreflow error. */
#define MATHACL_STATUS_UF_UNDERFLOW              ((uint32_t)0x00000001U)         /* !< Underflow error. */
/* MATHACL_STATUS[OVF] 溢出标志位（适用于MPY32/SQUARE32/DIV/MAC/SAC） */
/* MATHACL_STATUS[OVF] Bits */
#define MATHACL_STATUS_OVF_OFS                   (1)                             /* !< OVF Offset */
#define MATHACL_STATUS_OVF_MASK                  ((uint32_t)0x00000002U)         /* !< Overflow bit for MPY32, SQUARE32,
                                                                                    DIV, MAC, and SAC functions This bit
                                                                                    will be set on overflow and will
                                                                                    retain its value until cleared by
                                                                                    writing 1 into CLR.CLR_OVF */
#define MATHACL_STATUS_OVF_NO_OVERFLOW           ((uint32_t)0x00000000U)         /* !< No overflow error. */
#define MATHACL_STATUS_OVF_OVERFLOW              ((uint32_t)0x00000000U)         /* !< Overflow error. */
/* MATHACL_STATUS[ERR] 错误标志位（2位，指示输入/输出错误） */
/* MATHACL_STATUS[ERR] Bits */
#define MATHACL_STATUS_ERR_OFS                   (2)                             /* !< ERR Offset */
#define MATHACL_STATUS_ERR_MASK                  ((uint32_t)0x0000000CU)         /* !< Incorrect inputs/outputs. */
#define MATHACL_STATUS_ERR_NOERROR               ((uint32_t)0x00000000U)         /* !< No Error in computation. */
#define MATHACL_STATUS_ERR_DIVBY0                ((uint32_t)0x00000004U)         /* !< DIVBY0 error */
/* MATHACL_STATUS[BUSY] 忙标志位（1=运算进行中，0=运算完成） */
/* MATHACL_STATUS[BUSY] Bits */
#define MATHACL_STATUS_BUSY_OFS                  (8)                             /* !< BUSY Offset */
#define MATHACL_STATUS_BUSY_MASK                 ((uint32_t)0x00000100U)         /* !< MATHACL busy bit. */
#define MATHACL_STATUS_BUSY_DONE                 ((uint32_t)0x00000000U)         /* !< Compute has completed. */
#define MATHACL_STATUS_BUSY_NOTDONE              ((uint32_t)0x00000100U)         /* !< Compute ongoing */

/* ===== 状态清除寄存器 (STATUSCLR) 位域 ===== */
/* MATHACL_STATUSCLR Bits */
/* MATHACL_STATUSCLR[CLR_OVF] 溢出标志清除位（写1清除STATUS.OVF） */
/* MATHACL_STATUSCLR[CLR_OVF] Bits */
#define MATHACL_STATUSCLR_CLR_OVF_OFS            (1)                             /* !< CLR_OVF Offset */
#define MATHACL_STATUSCLR_CLR_OVF_MASK           ((uint32_t)0x00000002U)         /* !< Write 1 to this bit to clear
                                                                                    STATUS.OVF bit */
#define MATHACL_STATUSCLR_CLR_OVF_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MATHACL_STATUSCLR_CLR_OVF_CLR            ((uint32_t)0x00000002U)         /* !< Clear STATUS.OVF */
/* MATHACL_STATUSCLR[CLR_UF] 下溢标志清除位（写1清除STATUS.UF） */
/* MATHACL_STATUSCLR[CLR_UF] Bits */
#define MATHACL_STATUSCLR_CLR_UF_OFS             (0)                             /* !< CLR_UF Offset */
#define MATHACL_STATUSCLR_CLR_UF_MASK            ((uint32_t)0x00000001U)         /* !< Write 1 to this bit to clear
                                                                                    STATUS.UF bit */
#define MATHACL_STATUSCLR_CLR_UF_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MATHACL_STATUSCLR_CLR_UF_CLR             ((uint32_t)0x00000001U)         /* !< Clear STATUS.UF */
/* MATHACL_STATUSCLR[CLR_ERR] 错误标志清除位（写1清除STATUS.ERR） */
/* MATHACL_STATUSCLR[CLR_ERR] Bits */
#define MATHACL_STATUSCLR_CLR_ERR_OFS            (2)                             /* !< CLR_ERR Offset */
#define MATHACL_STATUSCLR_CLR_ERR_MASK           ((uint32_t)0x00000004U)         /* !< Write 1 to this bit to clear
                                                                                    STATUS.ERR field */
#define MATHACL_STATUSCLR_CLR_ERR_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define MATHACL_STATUSCLR_CLR_ERR_CLR            ((uint32_t)0x00000004U)         /* !< Clear STATUS.ERR */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_mathacl__include */
